package ru.levgrekov.data.tables

import ru.levgrekov.domain.logic.AvailableProductLogic
import ru.levgrekov.domain.logic.ProductType

val SigmoidText =
    "Друзья, готовьтесь к приключению, которое мы обозначим как \"финансовую фантазию\"! Приветствуйте, Карта Sigm'ОЙДА Black от банка СИГМА! Она - не просто пластиковый кусочек, это график вашего математического успеха, функция, которая не только ускоряет ваше финансовое движение, но и делает его кривым и гладким, как самая элегантная функция сигмоиды!\n" +
            "\n" +
            "Вот почему это круто:\n" +
            "\n" +
            "Математическая Гениальность: Карта Sigm'ОЙДА - это не просто карта, это эквивалент интеграла по всем вашим финансовым потребностям. Каждая транзакция - это не просто операция, это определенный интеграл вашего стиля жизни.\n" +
            "\n" +
            "Сигмоидная Сила: Когда дело доходит до вашего кредитного лимита, наша карта просто поднимает его до бесконечности, превращая любой долговой график в красивую сигмоиду.\n" +
            "\n" +
            "Эксклюзивные Привилегии: Карта Sigm'ОЙДА Black открывает перед вами двери к эксклюзивным мероприятиям, будь то конференции по математике или вечеринки для цифровых гуру. Вы всегда будете в центре внимания, как асимптота на графике.\n" +
            "\n" +
            "Безграничная Стабильность: Наша карта не только предоставляет вам безграничные возможности для трат, но и обеспечивает стабильность вашего финансового будущего, как надежная асимптотическая кривая, стремящаяся к нулю проблем.\n" +
            "\n" +
            "Финансовый Комфорт: С нашей картой вы можете забыть о финансовом дискомфорте, ведь она - ваш личный математический гений, который всегда на страже ваших денег и безопасности.\n" +
            "\n" +
            "Так что, если вы ищете не просто карту, а математическое произведение искусства и финансов, присоединяйтесь к нам и станьте частью семьи Sigm'ОЙДА!"

val SigmaMegaText =
    "Друзья, готовьтесь к волнующему финансовому путешествию с дебетовой картой \"Сигма-МЕГА\"! Это не просто карта, это сокровищница для самых крутых из нас, любителей смелых решений и финансовых подвигов!\n" +
            "\n" +
            "Вот почему она такая крутая:\n" +
            "\n" +
            "Мощь и Уверенность: \"Сигма-МЕГА\" - это не просто карта, это источник вашей финансовой мощи и уверенности. С ней у вас всегда будет под рукой надежный инструмент для осуществления ваших финансовых амбиций.\n" +
            "\n" +
            "Эксклюзивные Привилегии: Карта \"Сигма-МЕГА\" открывает перед вами двери к миру эксклюзивных привилегий. Будь то VIP-мероприятия или специальные предложения от партнеров, вы всегда будете на шаг впереди.\n" +
            "\n" +
            "Удобство и Простота: Мы знаем, что ваше время - это ценный ресурс. Поэтому \"Сигма-МЕГА\" обеспечивает максимальное удобство и простоту в использовании. Оплачивайте покупки, снимайте наличные и управляйте своими финансами легко и быстро.\n" +
            "\n" +
            "Безопасность и Надежность: Ваша безопасность - наш приоритет. \"Сигма-МЕГА\" обеспечивает защиту ваших средств и конфиденциальность ваших данных, чтобы вы могли спокойно сосредоточиться на своих финансовых целях.\n" +
            "\n" +
            "Так что, если вы ищете не просто дебетовую карту, а источник финансовой мощи, уверенности и привилегий, \"Сигма-МЕГА\" - ваш выбор номер один!"

val sigmaZelenText =
    "Добро пожаловать в увлекательный мир финансовых приключений с дебетовой картой \"Сигма-Зелень\"! Это не просто карта, это зеленое чудо, специально созданное для самых маленьких финансистов, которые только начинают свой путь в мире денег и финансовых взлетов!\n" +
            "\n" +
            "Вот почему она такая особенная:\n" +
            "\n" +
            "Финансовое Воспитание с Ранних Лет: Карта \"Сигма-Зелень\" - ваш первый шаг к финансовой грамотности. Мы верим, что дети - наше будущее, и поэтому предлагаем им уникальную возможность познакомиться с миром финансовых операций уже с самого раннего возраста.\n" +
            "\n" +
            "Зеленый Финансовый Сад: Пусть ваш ребенок окунется в мир зеленых финансовых лугов с \"Сигма-Зелень\"! Эта карта обеспечит вашего малыша финансовыми знаниями и навыками, которые будут основой для его успешного финансового будущего.\n" +
            "\n" +
            "Уникальные Привилегии для Маленьких: Карта \"Сигма-Зелень\" открывает перед вашим ребенком двери к миру эксклюзивных привилегий для маленьких финансистов. Будь то скидки в детских магазинах или специальные предложения от партнеров, ваш малыш будет чувствовать себя особенным.\n" +
            "\n" +
            "Безопасность и Забота: Мы понимаем, что безопасность вашего ребенка - ваша главная забота. Поэтому \"Сигма-Зелень\" обеспечивает высокий уровень защиты и контроля, чтобы вы могли спокойно отпустить своего малыша на путь к финансовой самостоятельности.\n" +
            "\n" +
            "Так что, если вы ищете не просто карту, а инструмент для финансового воспитания вашего ребенка, \"Сигма-Зелень\" - ваш выбор номер один!"

val sigmaAlgebraText = "Почему \"Сигма-Алгебра\" - ваш лучший выбор:\n" +
        "\n" +
        "Гибкость и Адаптивность: Карта \"Сигма-Алгебра\" предоставляет вам гибкость и адаптивность в управлении вашими финансами. Вы сами выбираете сумму кредитного лимита и сроки погашения, а мы обеспечиваем максимальное соответствие вашим потребностям.\n" +
        "\n" +
        "Прозрачность и Понимание: Мы не скрываем никаких скрытых комиссий или условий. \"Сигма-Алгебра\" предоставляет вам четкие правила игры и понятные условия, чтобы вы могли с уверенностью планировать свои финансовые действия.\n" +
        "\n" +
        "Бонусы и Награды: Пользуйтесь вашей картой \"Сигма-Алгебра\" и получайте бонусы и награды за каждую транзакцию. Накапливайте бонусные баллы и обменивайте их на скидки, подарки или дополнительные привилегии.\n" +
        "\n" +
        "Безопасность и Защита: Ваша безопасность - наша забота. \"Сигма-Алгебра\" обеспечивает высокий уровень защиты ваших средств и данных, чтобы вы могли сосредоточиться на своих финансовых целях, не беспокоясь о безопасности.\n" +
        "\n" +
        "Так что, если вы ищете не просто кредитную карту, а инструмент для математического успеха и финансового роста, \"Сигма-Алгебра\" - ваш верный спутник в мире финансовых вычислений!"


val availableCards = listOf(
    AvailableProductLogic.Full(
        0,
        "Сигм'ОЙДА",
        "Классическая дебетовая карта",
        "sigmoidBlack.png",
        SigmoidText,
        ProductType.CARD
    ),
    AvailableProductLogic.Full(
        1,
        "Сигма-МЕГА",
        "Дебетовая Карта для самых крутых",
        "sigmaAlgebra.png",
        SigmaMegaText,
        ProductType.CARD
    ),
    AvailableProductLogic.Full(
        2,
        "Сигма-Алгебра",
        "Кредитная Карта",
        "SigmaMega.png",
        sigmaAlgebraText,
        ProductType.CARD
    ),
    AvailableProductLogic.Full(
        3,
        "Сигма-Зелень",
        "Для самых маленьких",
        "SigmaJun.png",
        sigmaZelenText,
        ProductType.CARD
    ),

    AvailableProductLogic.Full(
        4,
        "Накопительный Счет",
        "Доходность до 85%, но это не точно",
        "SavingAccount.png",
        sigmaAlgebraText,
        ProductType.SAVING_ACCOUNT
    ),
    AvailableProductLogic.Full(
        5,
        "Вклад",
        "Процентная ставка 8%, но как только вы откроете его, мы повысим до 20%",
        "deposit.png",
        sigmaZelenText,
        ProductType.DEPOSIT
    )
)


